In [1]:
import pandas as pd
import numpy as np

# Combining Datasets: Merge and Join

In [2]:
#The behavior implemented in pd.merge() is a subset of what is known as relational
#algebra, which is a formal set of rules for manipulating relational data, and forms the
#conceptual foundation of operations available in most databases

# Categories of Joins

In [3]:
#The pd.merge() function implements a number of types of joins: the one-to-one,
#many-to-one, and many-to-many joins. All three types of joins are accessed via an
#identical call to the pd.merge() interface; the type of join performed depends on the
#form of the input data

# One-to-one joins

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})

In [6]:
print(df1);print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [7]:
#To combine this information into a single DataFrame , we can use the pd.merge() function:

In [8]:
df3=pd.merge(df1,df2)

In [9]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [10]:
#The pd.merge() function recognizes that each DataFrame has an “employee” column,
#and automatically joins using this column as a key. The result of the merge is a new
#DataFrame that combines the information from the two inputs. Notice that the order
#of entries in each column is not necessarily maintained: in this case, the order of the
#“employee” column differs between df1 and df2 , and the pd.merge() function cor‐
#rectly accounts for this. Additionally, keep in mind that the merge in general discards
#the index, except in the special case of merges by index

# Many-to-one joins

In [11]:
#Many-to-one joins are joins in which one of the two key columns contains duplicate
#entries. For the many-to-one case, the resulting DataFrame will preserve those dupli‐
#cate entries as appropriate

In [12]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})

In [15]:
print(df3);print("\n");print(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014


         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [16]:
print(pd.merge(df3,df4))

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [17]:
#The resulting DataFrame has an additional column with the “supervisor” information,
#where the information is repeated in one or more locations as required by the inputs

# Many-to-many joins

In [18]:
#Many-to-many joins are a bit confusing conceptually, but are nevertheless well
#defined. If the key column in both the left and right array contains duplicates, then
#the result is a many-to-many merge

In [19]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})

In [21]:
print(df1);print("\n");print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR


         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [22]:
print(pd.merge(df1,df5))

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [23]:
#These three types of joins can be used with other Pandas tools to implement a wide
#array of functionality. But in practice, datasets are rarely as clean as the one we’re
#working with here. In the following section, we’ll consider some of the options pro‐
#vided by pd.merge() that enable you to tune how the join operations work.

# Specification of the Merge Key

In [24]:
#We’ve already seen the default behavior of pd.merge() : it looks for one or more
#matching column names between the two inputs, and uses this as the key. However,
#often the column names will not match so nicely, and pd.merge() provides a variety
#of options for handling this.

# The on keyword

In [25]:
#Most simply, you can explicitly specify the name of the key column using the on key‐
#word, which takes a column name or a list of column names:

In [26]:
print(pd.merge(df1,df2,on='employee'))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [27]:
#This option works only if both the left and right DataFrame s have the specified column name.

# The left_on and right_on keywords

In [28]:
#At times you may wish to merge two datasets with different column names; for exam‐
#ple, we may have a dataset in which the employee name is labeled as “name” rather
#than “employee”.

In [29]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [30]:
#The result has a redundant column that we can drop if desired—for example, by
#using the drop() method of DataFrames

In [31]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

# The left_index and right_index keywords

In [32]:
#Sometimes, rather than merging on a column, you would instead like to merge on an index.

In [33]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [34]:
#You can use the index as the key for merging by specifying the left_index and/or
#right_index flags in pd.merge()

In [35]:
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [36]:
#For convenience, DataFrame s implement the join() method, which performs a
#merge that defaults to joining on indices

In [37]:
print(df1a.join(df2a))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [38]:
#If you’d like to mix indices and columns, you can combine left_index with right_on
#or left_on with right_index to get the desired behavior

In [39]:
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

# Specifying Set Arithmetic for Joins

In [40]:
#In all the preceding examples we have glossed over one important consideration in
#performing a join: the type of set arithmetic used in the join. This comes up when a
#value appears in one key column but not the other

In [42]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print(df6);print("\n") ;print(df7);print("\n") ; print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread


     name drink
0    Mary  wine
1  Joseph  beer


   name   food drink
0  Mary  bread  wine

In [43]:
#Here we have merged two datasets that have only a single “name” entry in common:
#Mary. By default, the result contains the intersection of the two sets of inputs; this is
#what is known as an inner join. We can specify this explicitly using the how keyword,
#which defaults to 'inner'

In [44]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [45]:
#Other options for the how keyword are 'outer' , 'left' , and 'right' . An outer join
#returns a join over the union of the input columns, and fills in all missing values with NAs

In [46]:
print(pd.merge(df6, df7, how='outer'))

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [48]:
#The left join and right join return join over the left entries and right entries, respec‐
#tively. For example

In [49]:
print(pd.merge(df6, df7, how='left'))

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [50]:
#The output rows now correspond to the entries in the left input. Using how='right'
#works in a similar manner

# Overlapping Column Names: The suffixes Keyword

In [51]:
#Finally, you may end up in a case where your two input DataFrame s have conflicting
#column names.

In [52]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [1, 2, 3, 4]})

In [53]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [3, 1, 4, 2]})

In [54]:
print(pd.merge(df8, df9, on="name"))

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [55]:
#Because the output would have two conflicting column names, the merge function
#automatically appends a suffix _x or _y to make the output columns unique. If these
#defaults are inappropriate, it is possible to specify a custom suffix using the suffixes
#keyword

In [56]:
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

# Example: US States Data

In [58]:
#Merge and join operations come up most often when one is combining data from dif‐
#ferent sources. Here we will consider an example of some data about US states and
#their populations. The data files can be found at http://github.com/jakevdp/data-USstates/

In [60]:
pop=pd.read_csv("datasets/state-population.csv")
areas=pd.read_csv("datasets/state-areas.csv")
abbrevs=pd.read_csv("datasets/state-abbrevs.csv")

In [61]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [63]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [64]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [65]:
#Given this information, say we want to compute a relatively straightforward result:
#rank US states and territories by their 2010 population density. We clearly have the
#data here to find this result, but we’ll have to combine the datasets to get it.
#We’ll start with a many-to-one merge that will give us the full state name within the
#population DataFrame . We want to merge based on the state/region column of pop ,
#and the abbreviation column of abbrevs . We’ll use how='outer' to make sure no
#data is thrown away due to mismatched labels.

In [78]:
merged=pd.merge(pop,abbrevs,left_on="state/region",right_on="abbreviation",how="outer")

In [79]:
merged=merged.drop("abbreviation",axis=1)

In [80]:
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [81]:
#Let’s double-check whether there were any mismatches here, which we can do by
#looking for rows with nulls:

In [83]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [84]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [85]:
#It appears that all the null population values are from Puerto Rico prior to the year
#2000; this is likely due to this data not being available from the original source

In [86]:
#More importantly, we see also that some of the new state entries are also null, which
#means that there was no corresponding entry in the abbrevs key! Let’s figure out
#which regions lack this match:

In [87]:
merged.loc[merged['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [88]:
#We can quickly infer the issue: our population data includes entries for Puerto Rico
#(PR) and the United States as a whole (USA), while these entries do not appear in the
#state abbreviation key. We can fix these quickly by filling in appropriate entrie

In [89]:
merged.loc[merged['state/region']=="PR",'state']="Puerto Rico"
merged.loc[merged['state/region']=="USA",'state']="United States"

In [90]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [92]:
#No more nulls in the state column: we’re all set!
#Now we can merge the result with the area data using a similar procedure. Examining
#our results, we will want to join on the state column in both

In [93]:
final=pd.merge(merged,areas,on="state",how="left")

In [94]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [96]:
#Again, let’s check for nulls to see if there were any mismatches

In [97]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [99]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [101]:
#We see that our areas DataFrame does not contain the area of the United States as a
#whole. We could insert the appropriate value (using the sum of all state areas, for
#instance), but in this case we’ll just drop the null values because the population den‐
#sity of the entire United States is not relevant to our current discussion

In [102]:
final.dropna(inplace=True)

In [103]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [104]:
#Now we have all the data we need. To answer the question of interest, let’s first select
#the portion of the data corresponding with the year 2000, and the total population.

In [106]:
final=final[final['ages']=="total"]

In [107]:
final

     state/region   ages  year  population        state  area (sq. mi)
1              AL  total  2012   4817528.0      Alabama        52423.0
3              AL  total  2010   4785570.0      Alabama        52423.0
5              AL  total  2011   4801627.0      Alabama        52423.0
6              AL  total  2009   4757938.0      Alabama        52423.0
9              AL  total  2013   4833722.0      Alabama        52423.0
...           ...    ...   ...         ...          ...            ...
2487           PR  total  2013   3615086.0  Puerto Rico         3515.0
2488           PR  total  2009   3740410.0  Puerto Rico         3515.0
2490           PR  total  2010   3721208.0  Puerto Rico         3515.0
2493           PR  total  2011   3686580.0  Puerto Rico         3515.0
2495           PR  total  2012   3651545.0  Puerto Rico         3515.0

[1238 rows x 6 columns]

In [108]:
final=final[final['year']==2010]

In [110]:
final.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [111]:
#Now let’s compute the population density and display it in order. We’ll start by rein‐
#dexing our data on the state, and then compute the result

In [112]:
final.set_index("state",inplace=True)

In [114]:
final.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [116]:
density=final['population']/final['area (sq. mi)']

In [117]:
density.sort_values(ascending=False,inplace=True)

In [118]:
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [119]:
#The result is a ranking of US states plus Washington, DC, and Puerto Rico in order of
#their 2010 population density, in residents per square mile. We can see that by far the
#densest region in this dataset is Washington, DC (i.e., the District of Columbia);
#among states, the densest is New Jersey.

In [120]:
#We can also check the end of the list:

In [121]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [122]:
#We see that the least dense state, by far, is Alaska, averaging slightly over one resident
#per square mile.

# Thank You